{
  "creatures": [
    {
      "name": "Test",
      "category": "Monstrosity",
      "size": "Medium",
      "type": "1",
      "alignment": "1",
      "armor": "1",
      "movement": "1",
      "temperament": "1",
      "vulnerabilities": [
        "1"
      ],
      "description": "1",
      "abilities": "1",
      "habitat": "1",
      "diet": "1"
    },
    {
      "name": "Darkspawn",
      "category": "Monstrosity",
      "size": "Medium",
      "type": "Darkspawn",
      "alignment": "Chaotic Evil",
      "armor": "Corrupted flesh hardened by the taint, often supplemented by crude but effective scavenged armor",
      "movement": "Tireless marchers through tunnels and ruins, capable of swarming prey with relentless pursuit",
      "temperament": "Bloodthirsty, hive-minded, and utterly merciless",
      "vulnerabilities": [
        "sunlight"
      ],
      "vulnerabilityDetails": {
        "sunlight": "The taint recoils from bright sunlight, it prefers the depths of the Deep Roads in shadow."
      },
      "description": "The darkspawn are twisted mockeries of men and beasts, corrupted by the Blight and driven by a singular will to spread it. Their skin is pallid or ashen, their eyes glow with a sickly light, and their presence carries the stench of rot and corruption. They emerge in endless hordes, guided by the call of the Old Gods they seek to unearth.",
      "abilities": "Resistance to pain and fatigue, darkvision in the deep roads, and the ability to spread the Taint through wounds and blood. Certain breeds wield sorcery born of corruption, while larger ones possess terrifying brute strength.",
      "habitat": "The Deep Roads—vast subterranean tunnels carved by the dwarves, now overrun by darkness. From here, they surge upward during Blights, spreading across the surface world like a plague.",
      "diet": "They feed on the flesh of the living and sometimes the dead, though hunger does not drive them as strongly as their compulsion to corrupt and destroy.",
      "behavior": "Swarming in coordinated packs, they fight without fear of death, for each darkspawn is but a vessel of the Blight. They are relentless in pursuit, cunning in ambush, and always seeking to unearth the sleeping Old Gods.",
      "lore": "Scholars claim the darkspawn were once men, dwarves, and elves who defiled the Golden City in arrogance, cursed forever by the Maker into these foul forms. They are the heralds of Blights—when an Old God is corrupted into an Archdemon, the darkspawn rise in unstoppable numbers, drowning the world in shadow until either the Archdemon is slain or civilization falls.",
      "image": "https://oathbounddnd.github.io/bestiary/images/Darkspawn.png"
    },
    {
      "name": "Dragon",
      "category": "Monstrosity",
      "size": "Medium",
      "type": "1",
      "alignment": "1",
      "armor": "1",
      "movement": "1",
      "temperament": "1",
      "vulnerabilities": [
        "1"
      ],
      "description": "1",
      "abilities": "1",
      "habitat": "1"
    },
    {
      "name": "Octopus",
      "category": "Monstrosity",
      "size": "Medium",
      "description": "11"
    },
    {
      "name": "Goblins",
      "category": "Humanoid",
      "size": "Small",
      "type": "Goblinoid",
      "alignment": "Neutral Evil",
      "armor": "Patchwork leathers, crude hides, or scavenged mail; not durable but often numerous",
      "movement": "Nimble and light-footed, capable of darting through forests, caves, and ruins with uncanny speed and agility",
      "temperament": "Cunning, spiteful, and treacherous; easily cowed by stronger foes but cruel when holding power over the weak",
      "vulnerabilities": [
        "sunlight",
        "fire"
      ],
      "vulnerabilityDetails": {
        "sunlight": "Though not harmed directly, goblins dislike the open day, preferring to fight in shadows, caves, or under the cover of night.",
        "fire": "Goblins fear fire instinctively, as it destroys their lairs and panics their mounts."
      },
      "description": "Goblins are small, wiry humanoids with sharp features, mottled skin, and glowing eyes that pierce the dark. Their voices are shrill and grating, and their laughter is cruel. They live in filthy warrens and camps, preying upon travelers, peasants, and any weaker than themselves. Though individually cowardly, in numbers they can overwhelm even seasoned warriors.",
      "abilities": "Darkvision, natural stealth, swarming tactics, and the ability to tame and ride wolves or worgs. They are also adept at crafting cruel traps and ambushes.",
      "habitat": "Goblins thrive in caves, abandoned ruins, dense forests, and desolate hills. Wherever civilization wanes, goblins infest the darkness.",
      "diet": "Omnivorous scavengers who eat whatever they can steal, hunt, or kill—including carrion and occasionally their own kind.",
      "behavior": "Petty and quarrelsome, goblins fight among themselves almost as often as they raid outsiders. They serve stronger overlords—hobgoblins, bugbears, orcs, or dark sorcerers—when compelled, but otherwise live in tribes led by the strongest and most brutal.",
      "lore": "Legends differ as to their origins—some say goblins are the twisted remnants of fey-kind, others that they are spawn of chaos and shadow. Their hatred of light, joy, and beauty is instinctual. To some cultures they are pests to be exterminated; to others, a dire threat that heralds greater wars.",
      "tactics": "Strike from ambush, raining arrows from hidden vantage points.\nUse numbers to swarm and overwhelm isolated targets.\nEmploy traps, pitfalls, and snares to weaken enemies before engaging.\nRetreat quickly if the battle turns against them, regrouping to attack again later.\nWhen mounted on wolves, they harry enemies with hit-and-run attacks, striking from flanks and rear.",
      "notes": "You'll often find a brooding site for goblins inside their warrens. Goblins breed with a handful of females who rarely leave the nest, thriving on the filth that surrounds them. Goblins can produce a little of 6 or 7 every few months, attributing to their number. Goblin offspring that fail to thrive are often eaten by the mothers.",
      "image": "https://oathbounddnd.github.io/bestiary/images/Goblin.png"
    }
  ]
}